%求解单应矩阵并优化,每一幅图像取5个点

function f=homography(m,M)  %M为世界坐标，m为图像焦点坐标
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%                    %随机 4点求单应 
%                    % 1 2 3 4
%    p=ones(8,8);
%    pp=ones(8,1);
% for i=1:4    %每幅图像取4个点
%      p(2*i-1,:)=[M(:,i)' 0 0 0 -m(1,i)*M(1:2,i)'];
%      p(2*i,:)=[0 0 0 -M(:,i)' m(2,i)*M(1:2,i)'];
%      pp(2*i-1,1)=m(1,i);
%      pp(2*i,1)=-m(2,i);
% end;
%   [U S V]=svd(p'*p); %正交分解
%   H=V(:,8);       %取V的最后一列
%   H=H/H(9);  
  
%   h=(p'*p)\(p'*pp);
%   H=ones(9,1);
%   H(1:8,1)=h;
                   % 1 2 4 5
%    p=ones(8,8);
%    pp=ones(8,1);
% for i=1:2   %每幅图像取4个点
%      p(2*i-1,:)=[M(:,i)' 0 0 0 -m(1,i)*M(1:2,i)'];
%      p(2*i,:)=[0 0 0 -M(:,i)' m(2,i)*M(1:2,i)'];
%      pp(2*i-1,1)=m(1,i);
%      pp(2*i,1)=-m(2,i); 
% end;
% 
%      p(5,:)=[M(:,4)' 0 0 0 -m(1,4)*M(1:2,4)'];
%      p(6,:)=[0 0 0 -M(:,4)' m(2,4)*M(1:2,4)'];
%      pp(5,1)=m(1,4);
%      pp(6,1)=-m(2,4); 
% 
%      p(7,:)=[M(:,5)' 0 0 0 -m(1,5)*M(1:2,5)'];
%      p(8,:)=[0 0 0 -M(:,5)' m(2,5)*M(1:2,5)'];
%      pp(7,1)=m(1,5);
%      pp(8,1)=-m(2,5); 
% 
%   h=(p'*p)\(p'*pp);
%   H=ones(9,1);
%   H(1:8,1)=h; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%                     %%% 5点求单应 %%% 
p=ones(10,9);
for i=1:5      %每幅图像取5个点
    p(2*i-1,:)=[M(:,i)' 0 0 0 -m(1,i)*M(:,i)'];
    p(2*i,:)=[0 0 0 -M(:,i)' m(2,i)*M(:,i)'];
end;
[U S V]=svd(p); %正交分解
% V
 H=V(:,9);       %取V的最后一列
% H=H/H(9);       %归一化
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  使用lsqnonlin进行非线性最小二乘求解
% 
%       options = optimset('LargeScale','on','Algorithm', 'levenberg-marquardt','TolFun',1e-6,'TolX',1e-6); % 'Display','final'
%       x = lsqnonlin( @fun1, reshape(H,1,9) , [],[],options, m, M);    %F给出目标函数的M文件[x,norm,res,ef,out,lam,jac] = lsqnonlin(@F,x0,v1,v2,opt,P1,P2, ... )缺省[]
%       x=x/x(9);
%   H=reshape(x,3,3); % 将矩阵H恢复为3*3 按列取得  %v1 v2 上下界 t,y: 拟合数据

H=reshape(H,3,3);	
H=H';
f=H;
    